#! Pip, мэнеджер пакетов Pip Installs Packages.

# pip - это система управления пакетами, которая используется для
# установки и управления программными пакетами, написанными на Python.

# Начиная с Python 3.4+ pip поставляется вместе с интерпретатором.

# Установка пакета с помощью pip:
# pip3 install numpy

# ОКАЗАЛОСЬ У МЕНЯ НЕТ PIP ... СЕЙЧАС УСТАНОВЛЮ.
# ОКАЗАЛОСЬ ЧТО ЕСТЬ И РАЗОБРАЛСЯ. ПОНЯЛ ЧТО МЕНЕДЖЕР ПАКЕТОВ.

# На линуксе:
# sudo pip3 install <package>

# Если не сработает - путь прописать дл pip3.py абсолютный

# Команды:
# pip help - помощь по доступным командам.
# pip install package_name - установка пакета(ов).
# pip uninstall package_name - удаление пакета(ов).
# pip list - список установленных пакетов.
# pip show package_name - показывает информацию об установленном пакете.
# pip search - поиск пакетов по имени.
# pip --proxy user:passwd@proxy.server:port - использование с прокси.
# pip install -U - обновление пакета(ов).
# pip install --force-reinstall - при обновлении, переустановить пакет,
# даже если он последней версии.
