# Вывести на экран любые две цифры из символов *  и любую букву из
# символов #.

print("  *\n" + "* *\n" + "  *\n" + "  *\n" + "  *\n" + "* * *")
print("######\n" + "##   ##\n" + "##  ##\n" + "#######\n" + "##    ##\n" +
      "##    ##\n" + "#######")
